Repository: YTEC-info/CH341A-Softwares
Catalog: Programas/Windows/NeoProgrammer/NeoProgrammer 2.1/lang/*.po
Languages: es, fr, ru

source: Page size is power of 2!
es: Tamaño de página debe ser potencia de 2!
fr: La taille de la page est définie sur un multiple de deux!
ru: Установлен размер страницы кратный двум!

source: Default page size is set
es: Se ha definido el tamaño de página por defecto
fr: La taille de page par défaut est définie.
ru: Установлен стандартный размер страницы

source: AVR initialisation failed
es: Inicialización de AVR fallida
fr: Echec initialisation AVR
ru: Ошибка инициализации AVR

source: Possible protection is enabled. Press "Unprotect" and check datasheet
es: La protección puede estar habilitada. Presione "Desproteger " y revise la hoja de datos
fr: Peut-être protection en écriture. Cliquez sur "Supprimer la protection" et vérifiez la fiche technique.
ru: Возможно включена защита на запись. Нажмите кнопку "Снять защиту" и сверьтесь с даташитом

source: Unprotect?
fr: Supprimer la protection?
ru: Снять защиту?

source: No data in buffer
es: No hay datos en el buffer
fr: Buffer vide
ru: Нет данных в буфере

source: Modified
es: Modificado
fr: Changé(s)
ru: Изменен

source: Lower AVR SPI Speed
es: Baja velocidad de AVR SPI
fr: Abaissement fréquence SPI AVR
ru: Более низкая скорость AVR SPI

source: Check settings
es: Revisar configuración
fr: Vérifier les paramètres
ru: Проверьте настройки

source: IC not responding
es: El chip no responde
fr: La puce ne repond pas
ru: Чип не отвечает

source: Choose an AVR Component in list
es: Elija un AVR en la lista
fr: Choisissez un AVR
ru: Выберите AVR в списке

source: Choose a Component in list
es: Elija un componente en la lista
fr: Choisissez un composant
ru: Выберите компонент в списке

source: IC will be erased and programmed. Continue?
es: El chip se borrará y programará. ¿Seguir?
fr: La puce sera effacée et écrasée. Continuer?
ru: Чип будет стерт и перезаписан. Продолжить?

source: Connected
es: Conectado
fr: Connecté
ru: Подключено

source: Connecting Error
es: Error de conexión
fr: Erreur de connexion
ru: Ошибка подключения к

source: Current programmer:
es: Programador actual:
fr: Programmeur actuel:
ru: Используется программатор:

# msgstr.str_disconnected
source: Disconnected
es: Desconectado
fr: Deconnecté
ru: Отключено

source: file modified
es: Archivo modificado
fr: Fichier modifié
ru: Файл изменён

source: File |*.bin;*.hex|File |*.bin|File |*.hex|Files |*.*
es: Archivo |*.bin;*.hex|Archivo |*.bin|Archivo |*.hex|Archivos |*.*
fr: Fichier |*.bin;*.hex|Fichier |*.bin|Fichier |*.hex|Fichiers |*.*
ru: файл |*.bin;*.hex|файл |*.bin|файл |*.hex|файлы |*.*

source: Save changes?
es: Guardar cambios?
fr: Sauvegarder les changements?"
ru: Сохранить изменения?

source: Done
es: Hecho
fr: Fait
ru: Готово

source: The process can take more than a minute on large flash memories!
es: ¡El proceso puede llevar más de un minuto en grandes memorias flash!
fr: Le processus peut prendre plus d’une minute sur de grandes mémoires flash!
ru: Процесс может длиться больше минуты на больших флешках!

source: Erasing memory...
es: Borrando memoria ...
fr: Effacement...
ru: Стираю флэшку...

source: Unsuccess
es: Fallo
fr: Echec
ru: Неудачно

# msgstr.str_goto_addr
source: Goto address
es: Ir a la dirección
fr: Aller à l'addresse
ru: Перейти по адресу

source: I2C Detection will fail with custom address
es: La detección de I2C fallará con la dirección personalizada
fr: La détection I2C échouera avec une adresse personnalisée
ru: Обнаружение I2C не удастся с пользовательским адресом

source: I2C Device Address:
es: Dirección del dispositivo I2C:
fr: Adresse du périphérique I2C:
ru: Адрес устройства I2C:

source: (Unknown ID)
es: (ID Desconocido)
fr: (ID Iconnu)
ru: (Неизвестно)

source: This firmware do not support I2C and 93Cxx
es: Este firmware no es compatible con I2C y 93Cxx
fr: Ce firmware ne supporte pas I2C et 93Cxx!
ru: Данная версия прошивки не поддерживает I2C и MW!

source: New SREG:
fr: Nouveau SREG:
ru: Стало Sreg:

source: Value not found
es: Valor no encontrado
fr: Valeur non trouvée
ru: Значение не найдено

source: This firmware do not support memory programming
es: Este firmware no admite programación de memoria
fr: Ce firmware n'est pas supporté!
ru: Данная версия прошивки не поддерживается!

source: This hardware is not supported!
es: ¡Este hardware no es compatible!
fr: Ce matériel n'est pas supporté!
ru: Это оборудование не поддерживается!

source: Old SREG:
fr: Ancien SREG:
ru: Было Sreg:

source: This action can be irreversible
es: Esta acción puede ser irreversible
fr: Cette action peut être irréversible
ru: Это действие может быть необратимым

source: Reading memory...
es: Leyendo memoria...
fr: Lecture memoire...
ru: Читаю флэшку...

source: There is no section:
es: No hay sección:
fr: Il n'y a pas de section:
ru: Нет секции:

source: Runs section:
es: Sección:
fr: Section en cours:
ru: Выполняется секция:

source: Select section
es: Seleccione sección
fr: Choisissez une section
ru: Выберите секцию

source: Search HEX value
fr: Recherche valeur HEX
ru: Поиск HEX значения

source: Selected CHIP:
es: CHIP seleccionado:
fr: CHIP sélectionné:
ru: Выбранная микросхема:

source: Error setting SPI speed
fr: Erreur de réglage de la vitesse SPI
ru: Ошибка установки скорости SPI

source: Size:
es: Tamaño:
fr: Taille:
ru: Размер:

source: Use HEX numbers
es: Valores HEX
fr: Spécifiez les nombres hexadécimaux
ru: Укажите шестнадцатеричные числа

source: Erase IC?
es: Borrar chip?
fr: Effacement IC?
ru: Точно стереть чип?

source: Start programming?
es: Iniciar programación?
fr: Commencer la programmation?
ru: Начать запись?

source: Execution time:
es: Tiempo de ejecución:
fr: Délai d'exécution:
ru: Время выполнения:

source: Success
es: Exito
fr: Succès
ru: Успех

source: USB_control_msg timeout!
fr: USB_control_msg est tombé en fin de timeout!
ru: USB_control_msg отвалился по таймауту!

source: Canceled by user
es: Cancelado por el usuario
fr: Interrompu par l'utilisateur
ru: Прервано пользователем

source: Script:
fr: Script utilisé:
ru: Используется скрипт:

source: Verify memory...
es: Verificando memoria...
fr: Verification memoire...
ru: Проверяю флэшку...

source: Verification error on address:
es: Error de verificación en la dirección:
fr: Erreur de comparaison à:
ru: Ошибка сравнения по адресу:

source: Programming memory...
es: Programando memoria...
fr: Ecriture memoire...
ru: Записываю флэшку...

source: Programming memory(verifying)...
es: Programando memoria(verificando)...
fr: Ecriture memoire(verification)...
ru: Записываю флэшку с проверкой...

source: Number of bytes readed not equal IC size
es: Cantidad de bytes leídos no es igual Tamaño de chip
fr: Le nombre d'octets lus n'est pas égal à la taille de la puce
ru: Количество прочитанных байт не равно размеру флэшки

source: Number of written bytes not equal IC size
es: Cantidad de bytes escritos no iguales Tamaño de chip
fr: Le nombre d'octets écrits n'est pas égal à la taille de la puce
ru: Количество записанных байт не равно размеру флэшки

source: File size larger than IC size
es: Tamaño del archivo mayor que el tamaño del chip
fr: Taille de fichier supérieure à la taille de la puce
ru: Размер файла больше размера чипа

source: Found:
es: Encontrado:
fr: Trouvé:
ru: Найдено:

source: Replaced:
es: Reemplazado:
fr: Remplacé:
ru: Заменено:

# tsregeditform.locksr2.caption
source: Read only
es: Solo lectura
fr: Lecture seule
ru: Только для чтения

# tsregeditform.locksr3.caption
source: Read only
es: Solo lectura
fr: Lecture seule
ru: Только для чтения

# tavrfusesform.btcancel.caption
source: Cancel
es: Cancelar
fr: Annuler
ru: Отмена

source: Load Default
es: Cargar por defecto
ru: По умолчанию

source: Read
es: Leer
fr: Lecture
ru: Читать

source: Write
es: Escribir
fr: Ecriture
ru: Записать

# tavrfusesform.fuselockgroup.hint
source: Read Only
es: Solo lectura
fr: Lecture seule
ru: Режим только для чтения

source: Value (16Bits):
es: Valor (16Bits):
fr: Valeur (16Bits):
ru: Значение (16Bits):

source: Value (8Bits):
es: Valor (8Bits):
fr: Valeur (8Bits):
ru: Значение (8Bits):

source: Cancel
es: Cancelar
fr: Annuler
ru: Отмена

source: Incremental values (00..FF)
es: Valores incrementales (00..FF)
fr: Valeurs incrémentales (00..FF)
ru: Добавочные значения (00..FF)

source: Random values
es: Valores aleatorios
fr: Valeurs aléatoires
ru: Случайные значения

source: Fill Buffer
es: Llenar buffer
fr: Emplir le Buffer
ru: Заполнить буфер

source: Start Address:
es: Desde:
fr: Addresse debut:
ru: Начальный адрес:

source: End Address:
es: Hasta:
fr: Addresse Fin:
ru: Конечный адрес:

source: Adapter scheme
es: Adaptador
fr: Adaptateur
ru: Схема адаптера

# tmainform.i2Cunprotbutton.caption
source: UnProt
es: Desprot.
fr: DeProt.
ru: Снять защиту

# tmainform.i2Cunprotbutton.hint
source: Removes protections
es: Elimina protecciones
fr: Raz protections
ru: Снять защиту

source: Blank Check
es: Verificar blanco
fr: Test effacement
ru: Проверка на чистоту

source: Verify
es: Verificar
fr: Verifier
ru: Сравнить содержимое

source: Erase
es: Borrar
fr: Effacement
ru: Стереть

source: Off-Protect
es: Desproteger
fr: Retirer la protection
ru: Снять защиту

# tmainform.autowrite.caption
source: Write
es: Escribir
fr: Ecrire
ru: Записать

source: BlankCheck
es: Verificar blanco
fr: Vérification effacement
ru: Проверка на чистоту

source: Buffer
ru: Буфер

source: Unprotect
es: Desproteger
fr: Supprimer la protection
ru: Снять защиту

source: Erase IC
es: Borrar chip
fr: Effacement IC
ru: Стереть

source: Setting
es: Configuración
ru: Настройки

source: Open File
es: Abrir archivo
fr: Ouvrir
ru: Открыть файл

source: Read IC
es: Leer chip
fr: Lecture IC
ru: Читать чип

source: Detect IC
es: Detectar chip
fr: Detecter Chip
ru: Определить чип

source: Save File
es: Guardar archivo
fr: Sauver
ru: Сохранить файл

source: Verify IC
es: Verificar chip
fr: Verification IC
ru: Сравнить содержимое

# tmainform.buttonwrite.hint
source: Write IC
es: Escribir chip
fr: Programmer IC
ru: Записать

source: Read Byte by Byte
es: Byte by Byte lectura
fr: Lect. octet par octet
ru: Побайтовое чтение

source: Read, Byte by Byte
es: Byte by Byte lectura
fr: Lecture octet par octet
ru: Читать байт за байтом

source: Clear
es: Limpiar
fr: Effacer
ru: Очистить

# tmainform.devbuttondetect.caption
source: Detect
es: Detectar
fr: Detecter
ru: Определить

# tmainform.devbuttondetect.hint
source: Detect IC
es: Detectar chip
ru: Определить чип

# tmainform.devbuttonsearch.caption
source: Search
es: Buscar
fr: Rechercher
ru: Поиск

source: Device
es: Dispositivo
fr: Composant
ru: Микросхема

# tmainform.devlabelbitsize.caption
source: BitSize:
es: Tamaño:
ru: Кол.бит:

# tmainform.devlabelmanuf.caption
source: Manuf:
es: Marca:
ru: Произв.:

# tmainform.devlabelname.caption
source: Name:
es: Nombre:
fr: Nom:
ru: Назв. :

# tmainform.devlabelpage.caption
source: Page:
es: Página:
ru: Страница:

# tmainform.devlabelsize.caption
source: Size:
es: Tamaño:
fr: Taille:
ru: Размер:

# tmainform.devlabeltype.caption
source: Type:
es: Tipo:
ru: Тип :

source: AVR SPI frequency
fr: Fréquence SPI AVR
ru: SPI AVR частота

source: IC size in bytes
es: Tamaño de chip en bytes
fr: Taille IC en bytes
ru: Размер чипа в байтах

source: Write Page size
es: Valor de tamaño de página
fr: Taille de la page en écriture
ru: Размер страницы

# tmainform.copylogmenuitem.caption
source: Copy
es: Copiar
fr: Copier
ru: Копировать

# tmainform.devbuttonclear.caption
source: Clear
es: Inicializar
fr: Initialiser
ru: Сброс

source: I2C advanced settings access
es: Acceso a la configuración avanzada de I2C
fr: Accès aux paramètres avancés I2C
ru: Доступ к расширенным настройкам I2C

source: Device address
es: Dirección del dispositivo
fr: Addresse du composant
ru: Адрес устройства

source: IC
es: Chip
ru: Микросхема

source: Clear the Buffer
es: Limpiar Buffer (FF)
fr: RaZ Buffer
ru: Очистить буфер

# tmainform.menucopytoclip.caption
source: Copy
es: Copiar
fr: Copier
ru: Копировать

source: Exit
es: Salir
fr: Sortie
ru: Выйти

source: File
es: Archivo
fr: Fichier
ru: Файл

source: Open
es: Abrir
fr: Ouvrir
ru: Открыть

source: Save
es: Guardar
fr: Sauver
ru: Сохранить

source: Fill the Buffer
es: Llenar el buffer
fr: Emplir le Buffer
ru: Заполнить буфер

# tmainform.menufindchip.caption
source: Search
es: Buscar
fr: Recherche
ru: Поиск

source: Find/Replace
es: Buscar/Remplazar
fr: Trouver/Rempl.
ru: Найти/Заменить

# tmainform.menugotooffset.caption
source: Goto address
es: Ir a dirección
fr: Aller à l'adresse
ru: Перейти по адресу

source: Edit SREG
fr: Edition SREG
ru: Изменить SREG

source: Hardware
es: Programador
fr: Matériel
ru: Программатор

source: Read SREG
fr: Lecture SREG
ru: Прочитать SREG

source: Load last device when starts
es: Cargar último dispositivo selecionado al iniciar
fr: Utiliser le dernier composant au démarrage
ru: Использовать последний чип при запуске

# tmainform.menumwclock.caption
source: Clock
fr: Frequence
ru: Частота

source: Options
es: Opciones
ru: Настройки

source: Paste
es: Pegar
fr: Coller
ru: Вставить

source: Skip FF
es: Saltar escribiendo FF
fr: Ne pas écrire les FF
ru: Не писать FF

# tmainform.menuspiclock.caption
source: Clock
fr: Fréqence
ru: Частота

source: Swap High and Low Bytes
es: Intercambiar Bytes High y Low
fr: Permuter les bytes H et L
ru: Поменять местами байты High и Low

source: Set device Address
es: Establecer el valor de la dirección del dispositivo
fr: Definir l'addresse du composant
ru: Установить адрес устройства

source: Scripts
ru: Скрипты

# tsearchform.caption
source: Search
es: Buscar
fr: Recherche
ru: Поиск

source: case sensitive
es: distingue mayúsculas y minúsculas
fr: Sensible à minuscule majuscule
ru: Учитывать регистр

source: Search
es: Buscar
fr: Trouver
ru: Найти

source: Search HEX
es: Buscar HEX
fr: Recherche HEX
ru: Искать HEX значение

# tsearchform.rcancelbutton.caption
source: Cancel
es: Cancelar
fr: Annuler
ru: Прервать

source: Repl. All
es: Reemp. Todo
fr: Rempl. Tout
ru: Замен. все

source: Replace
es: Reemplazar
fr: Remplacer
ru: Заменить

source: Replace:
es: Reemplazar:
fr: Remplacer:
ru: Заменить:

source: Search:
es: Buscar:
fr: Rechercher:
ru: Искать:

# tsregeditform.buttonreadsreg.caption
source: Read
es: Leer
fr: Lire
ru: Прочитать

# tsregeditform.buttonwritesreg.caption
source: Write
es: Escribir
fr: Ecrire
ru: Записать

source: Search IC
es: Buscar Chip
fr: Recherche IC
ru: Поиск микросхемы

source: Content:
es: Contenido:
fr: Le marquage contient:
ru: Маркировка содержит:

source: Select IC
es: Seleccionar Chip
fr: Selectionner IC
ru: Выбрать микросхему

source: File modified
es: Archivo modificado
fr: Fichier modifié
ru: Файл изменён

source: Open Script
es: Abrir Script
fr: Ouvrir un Script
ru: Открыть

source: Open bin
es: Abrir binario
fr: Ouvrir un bin
ru: Открыть bin

source: Execute
es: Ejecutar (F9)
fr: Executer
ru: Выполнить

source: Save as...
es: Guardar como...
fr: Enregistrer sous...
ru: Сохранить как...

source: Section =
es: Sección =
ru: Секция =

# tn76eform.readbutton.caption
source: Read
es: Leer
fr: Lecture
ru: Читать

# tn76eform.writebutton.caption
source: Write
es: Ecribir
fr: Ecriture
ru: Записать

# tn76eform.btcancel.caption
source: Cancel
es: Cancelar
fr: Annuler
ru: Отмена

# msgstr.str_main_mem
source: Main Memory
es: Memoria Principal

source: Fus Calc
es: Calular Fuses

source: HEX Values
es: Valores HEX
fr: Valeurs HEX

source: Limits
es: Límites
fr: Limites

# tmainform.avrclocklabel.caption
source: Clock:
es: Reloj:

source: Swap <-->
fr: Permuter
